devdnl/dnx-rtos/src/system/drivers/i2c/stm32f1/i2c_lld.c
                                        err = wait_for_I2C_event(hdl, I2C_SR1_RXNE);
                                        if (err) break;

                                        _I2C_LLD__stop(hdl);
                                        *dst++ = i2c->DR;
                                        n++;

                                        err = wait_for_I2C_event(hdl, I2C_SR1_RXNE);
                                        if (err) break;

                                        *dst++ = i2c->DR;
                                        n++;

                                        count = 0;
                                } else {
                                        err = wait_for_I2C_event(hdl, I2C_SR1_RXNE);
                                        if (!err) {
                                                *dst++ = i2c->DR;
                                                count--;
                                                n++;
                                        } else {
                                                break;
                                        }
                                }
                        }
                }

        } else if (count == 2) {
                sys_critical_section_begin();
                {
                        clear_send_address_event(hdl);
                        CLEAR_BIT(i2c->CR1, I2C_CR1_ACK);
                }
                sys_critical_section_end();

                err = wait_for_I2C_event(hdl, I2C_SR1_BTF);
                if (!err) {
                        _I2C_LLD__stop(hdl);

                        *dst++ = i2c->DR;
                        *dst++ = i2c->DR;
                        n     += 2;
                }

        } else if (count == 1) {
                CLEAR_BIT(i2c->CR1, I2C_CR1_ACK);
                clear_send_address_event(hdl);
                _I2C_LLD__stop(hdl);

                err = wait_for_I2C_event(hdl, I2C_SR1_RXNE);
                if (!err) {
                        *dst++ = i2c->DR;
                        n     += 1;
                }
        }

        _I2C_LLD__stop(hdl);

        *rdcnt = n;

        return err;
}

//==============================================================================
/**
 * @brief  Function transmit selected amount bytes to I2C bus
 * @param  hdl                  device handle
 * @param  src                  data source
 * @param  count                number of bytes to transfer
 * @return Number of written bytes
 */
//==============================================================================
int _I2C_LLD__transmit(I2C_dev_t *hdl, const u8_t *src, size_t count, size_t *wrcnt)
{
        int     err  = EIO;
        ssize_t n    = 0;
        I2C_t  *i2c  = get_I2C(hdl);

        clear_send_address_event(hdl);

#if USE_DMA > 0
        if (count >= 3 && _I2C[hdl->major]->use_DMA) {
                DMA_Channel_t *DMA = const_cast(DMA_Channel_t*, I2C_INFO[hdl->major].DMA_tx);

                DMA->CPAR  = cast(u32_t, &i2c->DR);
                DMA->CMAR  = cast(u32_t, src);
                DMA->CNDTR = count;
                DMA->CCR   = DMA_CCR1_MINC | DMA_CCR1_TCIE | DMA_CCR1_TEIE | DMA_CCR1_DIR;

                err = wait_for_DMA_event(hdl, DMA);
                if (!err) {
                        n = count;
                }
        } else
#endif
        {
                while (count) {
                        err = wait_for_I2C_event(hdl, I2C_SR1_TXE);
                        if (!err) {
                                i2c->DR = *src++;
                        } else {
                                break;
                        }

                        n++;
                        count--;
                }
        }

        if (n && !err) {
                err = wait_for_I2C_event(hdl, I2C_SR1_BTF);
                if (err) {
                        n = n - 1;
                }
        }

        *wrcnt = n;

        return err;
}

//==============================================================================
/**
 * @brief  Event IRQ handler (transaction state machine)
 * @param  major        number of peripheral
 * @return If IRQ was woken then true is returned, otherwise false
 */
//==============================================================================
static void IRQ_EV_handler(u8_t major)
{
        bool woken = false;

        I2C_t *i2c = const_cast(I2C_t*, I2C_INFO[major].I2C);
        u16_t  SR1 = i2c->SR1;
        u16_t  SR2 = i2c->SR2;
        UNUSED_ARG1(SR2);

        if (SR1 & _I2C[major]->SR1_mask) {
                sys_semaphore_signal_from_ISR(_I2C[major]->event, &woken);
                CLEAR_BIT(i2c->CR2, I2C_CR2_ITEVTEN | I2C_CR2_ITERREN | I2C_CR2_ITBUFEN);
                _I2C[major]->unexp_event_cnt = 0;
        } else {
                /*
                 * This counter is used to check if there is no death loop of
                 * not handled IRQ. If counter reach specified value then
                 * the error flag is set.
                 */
                if (++_I2C[major]->unexp_event_cnt >= 16) {
                        _I2C[major]->error = EIO;
                        sys_semaphore_signal_from_ISR(_I2C[major]->event, &woken);
                        CLEAR_BIT(I2C1->CR2, I2C_CR2_ITEVTEN | I2C_CR2_ITERREN | I2C_CR2_ITBUFEN);
                }
        }

        sys_thread_yield_from_ISR(woken);
}

//==============================================================================
/**
 * @brief  Error IRQ handler
 * @param  major        number of peripheral
 * @return If IRQ was woken then true is returned, otherwise false
 */
//==============================================================================
static void IRQ_ER_handler(u8_t major)
{
        I2C_t *i2c = const_cast(I2C_t*, I2C_INFO[major].I2C);
        u16_t  SR1 = i2c->SR1;
        u16_t  SR2 = i2c->SR2;
        UNUSED_ARG1(SR2);

        if (SR1 & I2C_SR1_ARLO) {
                _I2C[major]->error = EAGAIN;

        } else if (SR1 & I2C_SR1_AF) {
                if (_I2C[major]->SR1_mask & (I2C_SR1_ADDR | I2C_SR1_ADD10))
                        _I2C[major]->error = ENXIO;
                else
                        _I2C[major]->error = EIO;
        } else {
                _I2C[major]->error = EIO;
        }

